weewStack/STM32F1-Tutorial/042-STM32F1_SPI_COMMUNICATION_EXP_Nokia_n5110/SPI_drive.c
#include "stm32f10x.h" 
#include "gp_drive.h" 
#include "SPI_drive.h"

void spi_init(unsigned short spi){
RCC->APB2ENR |= 1; //Enable AFIO function

if(spi ==1)
{
	// Activate SPI-1 peripheral / AFIO function
	RCC->APB2ENR |= 0x1000; // Enabling the SPI-1 periph
	// Set up the pin 
	init_GP(PA,4,OUT50,O_GP_PP);
	init_GP(PA,5,OUT50,O_AF_PP);
	init_GP(PA,6,IN,I_PP);
	init_GP(PA,7,OUT50,O_AF_PP);

	//*******Setup SPI peripherals*****
	SPI1->CR1 |= 0x4; // Master Mode
	SPI1->CR1 |= 0x31; // fclk / 265
	SPI1->CR2 |= 0x4;
	SPI1->CR1 |= 0x40; // Enabling SPI SPI periph
	W_GP(PA,4,HIGH);
}else if(spi == 2){
	RCC->APB1ENR |= 0x4000; // Enabling the SPI-2 periph
		// Set up the pin 
	init_GP(PB,12,OUT50,O_GP_PP);
	init_GP(PB,13,OUT50,O_AF_PP);
	init_GP(PB,14,IN,I_PP);
	init_GP(PB,15,OUT50,O_AF_PP);

	//*******Setup SPI peripherals*****
	SPI2->CR1 |= 0x4; // Master Mode
	SPI2->CR1 |= 0x31; // fclk / 265
	SPI2->CR2 |= 0x4;
	SPI2->CR1 |= 0x40; // Enabling SPI SPI periph
	W_GP(PB,12,HIGH);
}
	
	

}


void spi_tx(unsigned short spi, char tx_char)
{
	if (spi ==1 )
	{
		W_GP(PA,4,LOW);
		SPI1->DR = tx_char;
		while(SPI1->SR & 0x80){}
		W_GP(PA,4,HIGH);
	}else if (spi ==2 )
	{
		W_GP(PB,12,LOW);
		SPI2->DR = tx_char;
		while(SPI2->SR & 0x80){}
		W_GP(PB,12,HIGH);
	}
}


void spi_msg(unsigned short spi, char str[])
{
int i =0;
	if (spi==1)
	{
	W_GP(PA,4,LOW);
	while(str[i])
	{
		SPI1->DR = str[i];
		while(SPI1->SR & 0x80){}
		i++;
	}
	W_GP(PA,4,HIGH);
	}
	else if (spi==2)
	{
	W_GP(PB,12,LOW);
	while(str[i])
	{
		SPI2->DR = str[i];
		while(SPI2->SR & 0x80){}
		i++;
	}
	W_GP(PB,12,HIGH);
	}
}
